{"class_name": "Functional", "config": {"name": "fnet_classifier", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int64", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 1500], "dtype": "float32", "input_dim": 10000, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1500}, "name": "embedding", "inbound_nodes": [[["input_ids", 0, 0, {}]]]}, {"class_name": "FNetEncoder", "config": {"name": "f_net_encoder", "trainable": true, "dtype": "float32", "intermediate_dim": 64, "dropout": 0, "activation": "relu", "layer_norm_epsilon": 1e-05, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "f_net_encoder", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "FNetEncoder", "config": {"name": "f_net_encoder_1", "trainable": true, "dtype": "float32", "intermediate_dim": 750.0, "dropout": 0, "activation": "relu", "layer_norm_epsilon": 1e-05, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "f_net_encoder_1", "inbound_nodes": [[["f_net_encoder", 0, 0, {}]]]}, {"class_name": "FNetEncoder", "config": {"name": "f_net_encoder_2", "trainable": true, "dtype": "float32", "intermediate_dim": 750.0, "dropout": 0, "activation": "relu", "layer_norm_epsilon": 1e-05, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "f_net_encoder_2", "inbound_nodes": [[["f_net_encoder_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling1d", "inbound_nodes": [[["f_net_encoder_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["global_average_pooling1d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}